{
  "basics": {
    "name": "Graham Lounder",
    "label": "Software Developer",
    "picture": "https://raw.githubusercontent.com/glounder/resume/master/profile-03.jpeg",
    "email": "graham.lounder@gmail.com",
    "phone": "(506) 866-5466",
    "summary": "Senior Developer with 18+ years of experience with all stages of development life cycle. Strong skills managing team workload, making decisions, and implementing solutions.  I’m focused on what needs to get done and making decisions to move forward.  I’m looking for a new challenge where I can learn new technologies and be a productive member of a highly motivated team.",
    "location": {
      "address": "31 Galbraith Cres",
      "postalCode": "E1G 2G3",
      "city": "Moncton",
      "countryCode": "CANADA",
      "region": "New Brunswick"
    },
    "profiles": [{
      "network": "LinkedIn",
      "url": "https://www.linkedin.com/in/graham-lounder"
    },{
      "network": "Github",
      "username": "glounder",
      "url": "https://github.com/glounder"
    }]
  },
  "work": [
    {
      "company": "Akiri",
      "position": "Senior Software Developer",
      "website": "https://akiri.com/",
      "startDate": "2018-02-01",
      "summary": "Currently working as a full stack developer, implementing a secure private network optimized for transferring healthcare data.  Akiri has built a cloud-based product to connect medical and health enterprises using VPN technology complete with auditing and disaster recovery features.",
      "highlights": [
        "Responsible for leading UI development using Vue and Vuetify.",
        "Championed e2e and unit test development within the UI using Cypress and Jest.",
        "Mentored junior developers by performing code reviews and providing UI design advice.",
        "Designed part of our monitoring solution using InfluxDB, Telegraf and Grafana.",
        "Developed disaster recovery for our InfluxDB monitoring solution across AWS regions.",
        "Implemented an RBAC solution in the UI to be able to hide/show any elements in the UI."
      ]
    },
    {
      "company": "Dell EMC",
      "position": "Manager Software Engineering",
      "website": "https://www.dellemc.com/",
      "startDate": "2017-01-01",
      "endDate": "2018-01-31",
      "summary": "Worked as head engineer on Nautilus, a real-time analytics and streaming storage solution backed by Isilon or ECS for long term storage.  Nautilus combines Pravega (streaming storage) and Apache Flink (streaming analytics) on top of a DC/OS managed cluster.  My team was responsible for the implementation of installing, monitoring, upgrading, and the serviceability of the product.",
      "highlights": [
        "Responsible for planning and ensuring team is meeting requirements and that the product is fully tested.",
        "Collaborating with teams outside of the Nautilus engineering team.",
        "Managing a team of 7 developers, 2 of which are remote.  Also responsible for representing the Pravega and Flink teams outside of the Nautilus.",
        "Using a Kanban board and weekly planning meetings to manage developer workload.",
        "Responsible for managing software releases and defining the release schedule.",
        "Perform code reviews to provide feedback to the development team.",
        "Designed and implemented the monitoring solution for Nautilus using the Influx TICK stack on top of DCOS.",
        "Worked on displaying charts and alerts in the Nautilus UI from the monitoring system."
      ]
    },
    {
      "company": "EMC",
      "position": "Manager Software Engineering",
      "website": "https://www.dellemc.com",
      "startDate": "2015-11-01",
      "endDate": "2017-01-01",
      "summary": "Managed the UI team on Neutrino where I coded 50% the time.  Neutrino was an appliance that provided customers with a turn key solution to running their own OpenStack cluster.  The project was terminated shortly after Dell acquired EMC and we moved to the Nautilus project.",
      "highlights": [
        "Managed a team of 7 developers, assigned work, conducted code reviews, and reported status to stakeholders.",
        "Colaborated with other teams within Neutrino to produce APIs required by the UI to improve user experience.",
        "Campaigned for and implemented a task monitoring system for Neutrino.  This gave great visibility into the cluster where services were being deployed/upgraded over multiple nodes that we couldn’t see before.",
        "Implemented a web version of the ScaleIO java UI using AngularJS.",
        "With the major rewrite from AngularJS to Angular 2, designed a phased plan to upgrade the Neutrino UI codebase.",
        "Implemented a system using web sockets to have changes made in the UI reflected to the other instances of the UI."
      ]
    },
    {
      "company": "EMC",
      "position": "Principal Software Engineer",
      "website": "https://www.dellemc.com",
      "startDate": "2013-01-01",
      "endDate": "2015-11-01",
      "summary": "Worked as an individual contributor on ViPR.  ViPR is a software-defined storage platform that abstracts, pools, and automates a data center’s underlying physical storage.  With the acquisition of iWave Software by EMC, the Storage Automator UI and host automation was added to the ViPR product."
    },
    {
      "company": "iWave Software",
      "position": "Senior Software Developer",
      "website": "",
      "startDate": "2012-06-01",
      "endDate": "2013-01-01",
      "summary": "Worked as an individual contributor on a new product called Storage Automator.  Storage Automator was designed to let users easily provision storage and mount it on hosts in one easy step.  Also worked on vSphere for VMAX (Flex UI) as a consultant to EMC.",
      "highlights": []
    },
    {
      "company": "VINVOX",
      "position": "Software Developer",
      "website": "",
      "startDate": "2010-09-01",
      "endDate": "2012-06-01",
      "summary": "Worked as an individual contributor for a local startup called VINVOX.  VINVOX was working on a hardware device that would monitor a vehicles mileage and error codes on the ODB port and transmit the data over the cell network to our servers. "
    },
    {
      "company": "Oracle",
      "position": "Senior Java Developer",
      "website": "https://www.oracle.com/",
      "startDate": "2006-10-01",
      "endDate": "2010-09-01",
      "summary": "I became an employee of Oracle through an acquisition of Skywire Software who had acquired Whitehill Technologies.  Worked on a product called Whitehill One which was used by law firms to speed up the intake of new customers.  Whitehill One would help mitigate risk to law firms by searching for conflicts of interest."
    },
    {
      "company": "CARIS",
      "position": "Team Lead",
      "website": "http://www.caris.com/",
      "startDate": "2002-05-01",
      "endDate": "2006-10-01",
      "summary": "Started as a web developer furthering CARIS' technologies into web based mapping (before the time of Google Maps). Eventually, my initial work in the area and numerous custom projects formed the basis of Spatial Fusion Enterprise.  Spatial Fusion Enterprise allows customers to host their own mapping data online."
    }
  ],
  "volunteer": [],
  "education": [
    {
      "institution": "University of New Brunswick",
      "area": "Computer Science",
      "studyType": "Bachelor",
      "startDate": "1996-09-01",
      "endDate": "2001-05-01",
      "gpa": ""
    }
  ],
  "awards": [],
  "publications": [],
  "skills": [
    {
      "name": "Web Technologies",
      "level": "",
      "keywords": [
        "Vue/Vuetify/Vuex",
        "Angular",
        "REST/JSON",        
        "NodeJS",
        "RxJS",
        "Web Sockets",        
        "HTML5",
        "SASS/CSS"
      ]
    },
    {
      "name": "Software Tools",
      "level": "",
      "keywords": [
        "GIT/SVN",
        "VS Code",
        "IntelliJ/Eclipse",
        "Sourcetree",
        "Jenkins",
        "Artifactory",
        "JIRA",
        "Trello"
      ]
    },
    {
      "name": "Programming Languages",
      "level": "",
      "keywords": [
        "Javascript/Typescript",
        "Java/Kotlin",
        "Python"
      ]
    },    
    {
      "name": "Infrastructure",
      "level": "",
      "keywords": [
        "AWS",
        "Docker",
        "Kubernetes/DCOS",
        "VMWare/OpenStack"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native speaker"
    },
    {
      "language": "French",
      "fluency": "Intermediate"
    }
  ],
  "interests": [
    {
      "name": "Ultimate Frisbee",
      "keywords": []
    },
    {
      "name": "Jogging",
      "keywords": []
    },    
    {
      "name": "Gaming",
      "keywords": []
    },
    {
      "name": "Tae Kwon Do",
      "keywords": []
    }
  ],
  "references": []
}